Enums/ВидыКурьеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКурьеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дополнительный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыГотовностиКурьеровКРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыГотовностиКурьеровКРаботе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГотов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Курьеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Курьеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКурьера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКурьеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовностьКРаботе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыГотовностиКурьеровКРаботе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриоритетныеМагазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МенеджерКурьеров/Ext/Module.bsl
Функция ПользовательЕстьВКурьерах() Экспорт
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курьеры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Курьеры КАК Курьеры
	|ГДЕ
	|	Курьеры.Наименование = &Наименование";	
	Запрос.УстановитьПараметр("Наименование", ИмяПользователя);
	ЕстьВКурьерах = НЕ Запрос.Выполнить().Пустой();  
	Возврат ЕстьВКурьерах; 
КонецФункции 

Функция ЭтоКурьер() Экспорт
	Возврат РольДоступна("Курьер");
КонецФункции 

Процедура ДобавитьПользователяВКурьеры() Экспорт  
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	НовыйКурьер = Справочники.Курьеры.СоздатьЭлемент();
	НовыйКурьер.Наименование = ИмяПользователя;
	НовыйКурьер.ВидКурьера = Перечисления.ВидыКурьеров.Дополнительный; 
	НовыйКурьер.ГотовностьКРаботе = Перечисления.СтатусыГотовностиКурьеровКРаботе.НеГотов;
	НовыйКурьер.Записать();
КонецПроцедуры  

Функция ПолучитьКурьера() Экспорт 
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курьеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Курьеры КАК Курьеры
	|ГДЕ
	|	Курьеры.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяПользователя);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
 	ВыборкаДетальныеЗаписи.Следующий();	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
КонецФункции     


Функция ПолучитьСтатусКурьера() Экспорт 
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курьеры.ГотовностьКРаботе КАК Статус
	|ИЗ
	|	Справочник.Курьеры КАК Курьеры
	|ГДЕ
	|	Курьеры.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяПользователя);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
 	ВыборкаДетальныеЗаписи.Следующий();	
	Возврат ВыборкаДетальныеЗаписи.Статус;
КонецФункции
